# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/thieu1995/csv-files/main/data/pandas/US_Baby_Names_right.csv).

In [2]:
data= pd.read_csv('us_baby.tsv')

In [3]:
data.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 182.2 MB

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names = data

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names=baby_names.drop(columns=['Unnamed: 0', 'Id'])
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [7]:
baby_names.groupby("Gender").sum()

,Name,Year,State,Count
Gender,,,,
F,EmmaMadisonHannahGraceEmilyAbigailOliviaIsabel...,1122736288,AKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAK...,16380293
M,EthanJosephJamesJacobSamuelTylerAlexanderJoshu...,919255329,AKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAKAK...,19041199

In [8]:
# import polars as pl
# baby_names = pl.read_csv('us_baby.tsv')
# baby_names.group_by(by='Gender').agg(pl.col('Count').sum())

### Step 7. Group the dataset by name and assign to names

In [16]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [17]:
len(baby_names['Name'].unique())

17632

### Step 9. What is the name with most occurrences?

In [18]:
baby_names.groupby('Name')['Count'].sum().idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [19]:
(baby_names.groupby('Name')['Count'].sum() == baby_names.groupby('Name')['Count'].sum().min()).sum()

np.int64(2578)

### Step 11. What is the median name occurrence?

In [20]:
baby_names.groupby('Name')['Count'].sum().median()

49.0

### Step 12. What is the standard deviation of names?

In [21]:
baby_names.groupby('Name')['Count'].sum().std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [22]:
baby_names.groupby('Name')['Count'].sum().describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64